[
    {
        "id": "1",
        "title": "Bulwarx Cybersecurity Platform",
        "description": "Internal Portal for a Leading Global Cybersecurity Company. Designed and developed a comprehensive internal portal that serves as a central hub for employees and partners.",
        "category": "web",
        "year": "2024",
        "client": "Bulwarx Security",
        "role": "Lead UI/UX Designer",
        "duration": "5 months",
        "overview": "The client was established following in-depth research, planning, and UI specification based on cybersecurity best practices. I designed and developed a comprehensive internal portal that serves as a central hub for employees and partners, focusing on security workflows and real-time threat monitoring.",
        "process": "My primary focus was on user-centered design and process engineering. I collaborated with security professionals to understand complex workflows and translate them into intuitive user interfaces. The process involved extensive user research, wireframing, prototyping, and iterative testing.",
        "impact": "The result is a cohesive, user-friendly portal that significantly improved workflow efficiency by 40% and enhanced user satisfaction within the cybersecurity operations. The portal now serves as a central tool for enhancing engagement and internal communications.",
        "tools": [
            "Figma",
            "Prototyping",
            "User Research",
            "Design Systems"
        ],
        "imageUrl": "static/images/projects/Bulwarx/Bulwarx_main.png",
        "detailImages": [
            "/api/placeholder/600/400",
            "/api/placeholder/600/400",
            "/api/placeholder/600/400"
        ],
        "featured": true
    },
    {
        "id": "2",
        "title": "DeviceChef Restaurant Management",
        "description": "Event-Driven Restaurant Management System with real-time monitoring capabilities and advanced analytics for kitchen operations.",
        "category": "complex-systems",
        "year": "2024",
        "client": "DeviceChef Inc",
        "role": "Product Designer & Developer",
        "duration": "5 months",
        "overview": "Restaurant owners needed a unified platform to manage orders, inventory, staff scheduling, and real-time kitchen operations. The existing systems were fragmented and lacked real-time capabilities, creating inefficiencies during peak hours.",
        "process": "Created an event-driven architecture with real-time updates, intuitive dashboard design, and comprehensive analytics. The approach focused on minimizing cognitive load for kitchen staff during peak hours while providing comprehensive management tools for owners.",
        "impact": "The platform resulted in 40% faster order processing, reduced food waste by 30%, and improved overall kitchen efficiency significantly. Multi-location support enabled franchise growth.",
        "tools": [
            "Figma",
            "User Research",
            "Prototyping",
            "Dashboard Design"
        ],
        "imageUrl": "/api/placeholder/800/500",
        "detailImages": [
            "/api/placeholder/600/400",
            "/api/placeholder/600/400"
        ],
        "featured": true
    },
    {
        "id": "3",
        "title": "Ginegar E-commerce Platform",
        "description": "E-commerce Platform for a Global Agricultural Products Company specializing in greenhouse solutions and agricultural products.",
        "category": "web",
        "year": "2024",
        "client": "Ginegar Plastic Products",
        "role": "Full Stack Designer",
        "duration": "5 months",
        "overview": "A leading global agricultural company needed to transition from traditional B2B sales to a digital-first approach, requiring a platform that could handle complex agricultural product catalogs, international shipping, and multi-language support.",
        "process": "Designed a clean, nature-inspired interface with intuitive product categorization, advanced filtering options, and seamless checkout experience. Implemented multi-currency support and localized content management across 15 countries.",
        "impact": "The platform launched successfully across 15 countries, resulting in 60% increase in online sales and significantly expanded market reach. Customer satisfaction improved with streamlined ordering process.",
        "tools": [
            "Shopify Plus",
            "React",
            "Node.js",
            "PostgreSQL",
            "Stripe",
            "Multi-language UI"
        ],
        "imageUrl": "",
        "detailImages": [
            "/api/placeholder/600/400",
            "/api/placeholder/600/400",
            "/api/placeholder/600/400"
        ],
        "featured": true
    }
]